#############################################################
#############################################################
# ~/.Brewfile - Software Installs for MacOS                 #
#                                                           #
# list of packages I keep via Homebrew                      #
#                                                           #
# author:  Pedro Maia                                       #
# apps are sorted alphabetically                            #
# sorce: https://www.github.com/phovmaia/dot                #
# see brew docs for mode info: https://docs.brew.sh         #
#############################################################
#############################################################

# options
cask_args appdir: '~/Applications', require_sha: true

# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "homebrew/core"
tap "aws/tap"
tap "noovolari/brew"
tap "spotinst/tap"

#############################################################
# command line (CLI)                                        #
#############################################################

# CLI essentials
brew "git"                          # version controll
brew "neovim"                       # text editor
brew "starship"                     # shell prompt

# cli basics
brew "aria2"                    # better wget
brew "bat"                      # better cat
brew "diff-so-fancy"            # better diff
brew "dotdrop"                  # dotfiles manager
brew "duf"                      # better df
brew "exa"                      # better ls
brew "jq"                       # json parser
brew "procs"                    # better ps
brew "ripgrep"                  # better grep
brew "rsync"                    # better cp
brew "thefuck"                  # better auto correct
brew "tldr"                     # community-maintained docs (better man)
brew "tree"                     # directory listing as tree structure
brew "xsel"                     # copy/paste to/from clipboard
brew "zoxide"                   # auto-learning navigation (better cd)

# cli monitoring tools
brew "bmon"                     # bandwidth utilization monitor
brew "bpytop"                   # better htop
brew "ctop"                     # container metrics and stats
brew "dog"                      # better dig
brew "gping"                    # better ping
brew "speedtest-cli"            # internet speed test

# cli productivity tools
brew "enpass-cli"               # password manager

# cli devlopment suits
brew "httpie"                   # HTTP / API testing client
brew "lazydocker"               # full docker management app
brew "lazygit"                  # full git management app
brew "kdash"                    # kubernetes dashboard

# cli external services
brew "asciinema"                # record terminal sessions
brew "navi"                     # cheatsheet tool
brew 'tmate'                    # Share a terminal session via internet

# cli fun
brew "asciiquarium"             # fish tank in terminal
brew "cowsay"                   # cow say your message
brew "figlet"                   # output text as big ASCII art text
brew "lolcat"                   # output raibow colored text
brew "neofetch"                 # show system data and ditstro info
brew "pipes-sh"                 # terminal pipe screen saver

#############################################################
# Software Development                                      #
#############################################################

# development apps
cask "warp"                     # better terminal
cask "insomnia"                 # API testing client
cask "postman"                  # API testing client
cask "visual-studio-code"       # code editor

# development languages, compilers, package managers
brew "gcc"                      # C/C++ compiler
brew "go"                       # go compiler
brew "lua"                      # lua interpreter
brew "luarocks"                 # lua package manager
brew "nvm"                      # node version manager
brew "python"                   # python interpreter
brew "rust"                     # rust language

# devops
brew "ansible"                  # configuration management tool
brew "docker"                   # containerization tool
brew "docker-compose"           # container orchestration tool
brew "helm"                     # kubernetes package manager
brew "kubernetes-cli"           # kubernetes cli
brew "kubectx"                  # kubernetes cli context manager
brew "terraform"                # infrastructure as code tool
brew "terragrunt"               # terraform wrapper
brew "teleport"                 # ssh server
brew "velero"                   # kubernetes backup tool

# development utilities
brew "gh"                       # github cli
brew "gitkraken"                # git gui

# network tools
brew "bettercap"                # network scanning and monitoring
brew "nmap"                     # port scanner
cask "wireshark"                # network analyzer + packet capture

# security tools
brew "openssl"                  # ssl/tls toolkit
brew "openssh"                  # ssh client and server
brew "ca-certificates"          # ssl/tls certificates

# aws cli tools
brew "amazon-ecs-cli"           # amazon ecs cli
brew "aws/tap/copilot-cli"      # amazon cli tool for ecs, eks and other
brew "awscli"                   # amazon cli
cask "session-manager-plugin"   # aws session manager plugin
brew "eksctl"                   # amazon eks cli

brew "ddgr"
brew "mdbook"
brew "yq"
brew "zk"
brew "noovolari/brew/leapp-cli"
brew "spotinst/tap/spotctl"

#############################################################
# desktop applications                                      #
#############################################################

# casks
cask "amazon-chime"
cask "balenaetcher"
cask "betterdisplay"
cask "brave-browser"
cask "drawio"
cask "enpass"
cask "focused"
cask "google-cloud-sdk"
cask "hiddenbar"
cask "leapp"
cask "lens"
cask "macdown"
cask "obs"
cask "postman"
cask "postman-cli"
cask "raycast"
cask "telegram"
cask "termius"
cask "warp"
cask "webcatalog"
cask "whatsapp"
cask "zoom" # video conferencing

# fonts

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack'
cask 'space-mono'