tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "noovolari/brew"
tap "spotinst/tap"
brew "amazon-ecs-cli"
brew "ca-certificates"
brew "aria2"
brew "asciinema"
brew "asciiquarium"
brew "awscli"
brew "bat"
brew "bpytop"
brew "ctop"
brew "datree"
brew "ddgr"
brew "docker-compose"
brew "dog"
brew "dotdrop"
brew "duf"
brew "eksctl"
brew "enpass-cli"
brew "exa"
brew "gh"
brew "go"
brew "go-task"
brew "gping"
brew "grep"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "luarocks"
brew "mdbook"
brew "navi"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "openssh"
brew "procs"
brew "python@3.10"
brew "python-tk@3.10"
brew "python@3.9"
brew "python-tk@3.9"
brew "ripgrep"
brew "rust"
brew "speedtest-cli"
brew "starship"
brew "teleport"
brew "terraform"
brew "terragrunt"
brew "thefuck"
brew "tldr"
brew "tre"
brew "tree"
brew "velero"
brew "wget"
brew "yq"
brew "zk"
brew "zsh-syntax-highlighting"
brew "aws/tap/copilot-cli"
brew "noovolari/brew/leapp-cli"
brew "spotinst/tap/spotctl"
cask "amazon-chime"
cask "balenaetcher"
cask "betterdisplay"
cask "brave-browser"
cask "drawio"
cask "enpass"
cask "focused"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "kindle"
cask "leapp"
cask "lens"
cask "macdown"
cask "obs"
cask "postman"
cask "postman-cli"
cask "raycast"
cask "session-manager-plugin"
cask "telegram"
cask "termius"
cask "warp"
cask "webcatalog"
cask "whatsapp"
cask "zoom"
